base/Catalogs/бит_КомплектыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_КомплектыДвижений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеВерсииХО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВерсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыКомплектовДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>//Пользователь, создавший документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>//Пользователь, утвердивший комплект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередФормированиемПроводокВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеФормированияПроводокВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчикаПроведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтекПеременных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоРучныеИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШаблоныДвижений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШаблонДвижения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Переменные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>999</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/CommonModules/бит_МеханизмХозяйственныхОперацийКлиент/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Генерирует наименование для шаблона движений.
// 
// Параметры:
//  ШаблонОбъект - СправочникОбъект.бит_ШаблоныДвижений.
// 
Процедура ПолучитьНаименованиеШаблонаДвижений(ШаблонОбъект) Экспорт

	ШаблонНаименование = "" + Строка(ШаблонОбъект.Регистр) + " --> " + Строка(ШаблонОбъект.ВидДокумента) + " --> " + ШаблонОбъект.Код;
	
	Если Найти(ШаблонОбъект.Наименование, " --> ") > 0 ИЛИ СокрЛП(ШаблонОбъект.Наименование) = "" Тогда
		ШаблонОбъект.Наименование = ШаблонНаименование;
	КонецЕсли;
	
КонецПроцедуры // ПолучитьНаименованиеШаблонаДвижений()

// Добавляет шаблон в выбранный интерактивно комплект.
// 
// Параметры:
//  ШаблонОбъект - СправочникОбъект.бит_ШаблоныДвижений.
//                 
Процедура ВключитьШаблонВКомплектИнтерактивно(ШаблонСсылка, ВидДокумента) Экспорт

	// Откроем модально форму выбора комплектов движений
	// с отбором по виду документа. Если вид документа - не заполнен
	// выведем сообщение об ошибке.
	
	Если НЕ ЗначениеЗаполнено(ВидДокумента) Тогда		
		ТекстСообщения = НСтр("ru='Не выбран вид документа.';en='Do not select the document type.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);		
		Возврат;		
	КонецЕсли;
	
	УсловияОтбора = Новый Структура;
	УсловияОтбора.Вставить("ВидДокумента", ВидДокумента);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", УсловияОтбора);
	ФормаВыбора = ПолучитьФорму("Справочник.бит_КомплектыДвижений.ФормаВыбора", ПараметрыФормы);
	
	ДопПараметры = Новый Структура("ШаблонСсылка", ШаблонСсылка);
	ОбработчикВК = Новый ОписаниеОповещения("ВключитьШаблонВКомплектЗавершение", бит_МеханизмХозяйственныхОперацийКлиент.ЭтотОбъект, ДопПараметры);
	ОткрытьФорму(ФормаВыбора.ИмяФормы,,,,,, ОбработчикВК, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	
КонецПроцедуры // ВключитьШаблонВКомплектИнтерактивно()

// Процедура включает шаблон в комплект.
// 
Процедура ВключитьШаблонВКомплектЗавершение(ВыбранныйКомплект, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(ВыбранныйКомплект) Тогда
		бит_МеханизмХозяйственныхОперацийВызовСервера.ВключитьШаблонВКомплект(ДопПараметры.ШаблонСсылка, ВыбранныйКомплект);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьКомплектПоШаблонуДвижения(ШаблонДвижения, ВидДокумента) Экспорт

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ВидДокумента", ВидДокумента);
	ДанныеЗаполнения.Вставить("ШаблонДвижения", ШаблонДвижения);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
	
	ОткрытьФорму("Справочник.бит_КомплектыДвижений.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
